
## Plan Result




<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_virtual_machine_extension.AADSSHLoginForLinux[0]
  * azurerm_virtual_machine_extension.install_docker[0]
  * module.virtual_machine[0].azurerm_linux_virtual_machine.linvm[0]
  * module.virtual_machine[0].azurerm_network_interface.vm_nic
  * module.virtual_machine[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.virtual_machine[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.virtual_machine[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_virtual_machine_extension.AADSSHLoginForLinux[0] will be created
  + resource "azurerm_virtual_machine_extension" "AADSSHLoginForLinux" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AADSSHLoginForLinux"
      + publisher                   = "Microsoft.Azure.ActiveDirectory"
      + tags                        = {
          + "application"         = "juror"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/juror-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#juror-dev"
          + "environment"         = "staging"
          + "managedBy"           = "Juror"
        }
      + type                        = "AADSSHLoginForLinux"
      + type_handler_version        = "1.0"
      + virtual_machine_id          = (known after apply)
    }

  # azurerm_virtual_machine_extension.install_docker[0] will be created
  + resource "azurerm_virtual_machine_extension" "install_docker" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "InstallDocker"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.CPlat.Core"
      + tags                        = {
          + "application"         = "juror"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/juror-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#juror-dev"
          + "environment"         = "staging"
          + "managedBy"           = "Juror"
        }
      + type                        = "RunCommandLinux"
      + type_handler_version        = "1.0"
      + virtual_machine_id          = (known after apply)
    }

  # module.virtual_machine[0].azurerm_linux_virtual_machine.linvm[0] will be created
  + resource "azurerm_linux_virtual_machine" "linvm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "juror-admin"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "uksouth"
      + max_bid_price                                          = -1
      + name                                                   = "juror-db-migration-stg-vm01"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "juror-stg-rg"
      + size                                                   = "Standard_E4-2s_v3"
      + tags                                                   = {
          + "application"         = "juror"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/juror-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#juror-dev"
          + "environment"         = "staging"
          + "managedBy"           = "Juror"
        }
      + virtual_machine_id                                     = (known after apply)
      + zone                                                   = "1"

      + boot_diagnostics {}

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 500
          + name                      = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "22.04-LTS"
          + version   = "latest"
        }
    }

  # module.virtual_machine[0].azurerm_network_interface.vm_nic will be created
  + resource "azurerm_network_interface" "vm_nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "juror-db-migration-stg-vm01-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "juror-stg-rg"
      + tags                          = {
          + "application"         = "juror"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/juror-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#juror-dev"
          + "environment"         = "staging"
          + "managedBy"           = "Juror"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "juror-db-migration-stg-vm01-ipconfig"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/stg/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/iaas"
        }
    }

  # module.virtual_machine[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] will be created
  + resource "azurerm_virtual_machine_extension" "azure_monitor" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AMALinux"
      + publisher                   = "Microsoft.Azure.Monitor"
      + tags                        = {
          + "application"         = "juror"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/juror-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#juror-dev"
          + "environment"         = "staging"
          + "managedBy"           = "Juror"
        }
      + type                        = "AzureMonitorLinuxAgent"
      + type_handler_version        = "1.9"
      + virtual_machine_id          = (known after apply)
    }

  # module.virtual_machine[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] will be created
  + resource "azurerm_virtual_machine_extension" "custom_script" {
      + auto_upgrade_minor_version  = false
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "HMCTSVMBootstrap"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Azure.Extensions"
      + tags                        = {
          + "application"         = "juror"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/juror-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#juror-dev"
          + "environment"         = "staging"
          + "managedBy"           = "Juror"
        }
      + type                        = "CustomScript"
      + type_handler_version        = "2.1"
      + virtual_machine_id          = (known after apply)
    }

  # module.virtual_machine[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0] will be created
  + resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "Dynatrace"
      + publisher                   = "dynatrace.ruxit"
      + settings                    = (sensitive value)
      + tags                        = {
          + "application"         = "juror"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/juror-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#juror-dev"
          + "environment"         = "staging"
          + "managedBy"           = "Juror"
        }
      + type                        = "oneAgentLinux"
      + type_handler_version        = "2.200"
      + virtual_machine_id          = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":29,"Program":"tfcmt","SHA1":"","Vars":{}} -->